IDENTIFICATION DIVISION.
PROGRAM-ID. Hello_World.
DATA DIVISION.
	WORKING-STORAGE SECTION.
		01 WS-NAME PIC A(6) VALUE IS 'World!'.


PROCEDURE DIVISION.
	DISPLAY "Hello "WS-NAME.

	STOP RUN. 
